// 为什么运行 0.1 + 0.2 不等于 0.3？
//js不太擅长做计算， 会丢失精度， 所以会出现这种情况
//只有一种Number类型
//不精确
//0.1在js中是怎样去表达的？  二进制 无限不循环小数 不精确 IEEE754
//0.1-> 0.0001100110011001100110011001100110011001100110011001101
//0.2-> 0.0011001100110011001100110011001100110011001100110011010
//0.3-> 0.010011001100110011001100110011001100110011001100110100
// 64位  符号位1位  指数位11位  尾数位52位 
/* console.log(0.1 + 0.2) */
// 显示时控制精度（返回字符串）


// 转换为数字（注意可能重新引入误差）
/* console.log(+(0.1 + 0.2).toFixed(1)); // 0.3 */
// 将 0.1+0.2 转为 1+2 计算
const result = (1n + 2n) / 10n; 
console.log(Number(result)); // 0.3